app/views/dashboard/index.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."course_id" = $2 LIMIT $3  [["user_id", 188], ["course_id", 61], ["LIMIT", 1]]
---
                              data: { turbo_method: :post } do %>
                            <i class="far fa-heart <%= 'text-danger' if current_user.favorites.find_by(course_id: course.id).present? %>"></i>