app/views/courses/_courses.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."course_id" = $2 LIMIT $3  [["user_id", 332], ["course_id", 135], ["LIMIT", 1]]
---
              data: { turbo_method: :post } do %>
            <i class="<%= current_user.favorites.find_by(course_id: course.id).present? ? 'fas' : 'far' %> fa-heart"></i>