app/controllers/announcements_controller.rb

SELECT "announcements".* FROM "announcements"
---
  def index
    @courses = Course.all
    @announcements = Announcement.all

INSERT INTO "announcements" ("title", "content", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New"], ["content", "Details"], ["created_at", "2025-04-07 08:30:21.200097"], ["updated_at", "2025-04-07 08:30:21.200097"], ["image", nil]]
---
 def create
   @announcement = Announcement.new(announcement_params)
   if @announcement.save

UPDATE "announcements" SET "title" = $1, "updated_at" = $2 WHERE "announcements"."id" = $3  [["title", "Updated"], ["updated_at", "2025-04-07 08:30:21.303447"], ["id", 35]]
---
  def update
    if @announcement.update(announcement_params)

DELETE FROM "announcements" WHERE "announcements"."id" = $1  [["id", 37]]
---
  def destroy
    @announcement.destroy

SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
  def set_announcement
    @announcement = Announcement.find(params[:id])