app/controllers/assignments_controller.rb

  def new
    @assignment = Assignment.new
    @courses = Course.all.pluck(:title, :id)
---
SELECT "courses"."title", "courses"."id" FROM "courses"

  def create
    @assignment = Assignment.new(assignment_params)
    if @assignment.save
---
INSERT INTO "assignments" ("title", "description", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Assignment"], ["description", "Something interesting"], ["course_id", 18], ["created_at", "2025-04-07 08:32:51.776897"], ["updated_at", "2025-04-07 08:32:51.776897"]]

  def edit
    @courses = Course.all.pluck(:title, :id)
---
SELECT "courses"."title", "courses"."id" FROM "courses"

  def update
    if @assignment.update(assignment_params)
---
UPDATE "assignments" SET "title" = $1, "updated_at" = $2 WHERE "assignments"."id" = $3  [["title", "Updated Title"], ["updated_at", "2025-04-07 08:32:51.905403"], ["id", 7]]

  def destroy
    @assignment.destroy
---
DELETE FROM "assignments" WHERE "assignments"."id" = $1  [["id", 8]]