app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = if params[:search].present?
      Course.where("title ILIKE ?", "%#{params[:search]}%")
    else
      Course.all

SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = $1 ORDER BY "assignments"."id" DESC  [["course_id", 39]]
---
  def show
    @assignments = @course.assignments.order(id: :desc)

INSERT INTO "courses" ("title", "code", "status", "term_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "New Course"], ["code", "IT-957-OLA4"], ["status", 0], ["term_id", 41], ["created_at", "2025-04-07 08:41:38.759560"], ["updated_at", "2025-04-07 08:41:38.759560"]]
---
  def create
    @course = Course.new(course_params)
    if @course.save

UPDATE "courses" SET "title" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["title", "Updated Title"], ["updated_at", "2025-04-07 08:41:38.840902"], ["id", 45]]
---
  def update
    if @course.update(course_params)

SELECT "terms"."name", "terms"."id" FROM "terms"
---
  def set_terms
    @terms = Term.all.pluck(:name, :id)