app/controllers/dashboard_controller.rb

  def index
    @courses = Course.all
    @announcements = Announcement.all
---
SELECT "courses".* FROM "courses"
SELECT "announcements".* FROM "announcements"

  def add_to_favorite
    fav = current_user.favorites.find_by(course_id: params[:course_id])
    if fav.present?
      fav.destroy
    else
      current_user.favorites.create(course_id: params[:course_id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."course_id" = $2 LIMIT $3  [["user_id", 204], ["course_id", 77], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 5]]
INSERT INTO "favorites" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 204], ["course_id", 77], ["created_at", "2025-04-07 08:55:36.716336"], ["updated_at", "2025-04-07 08:55:36.716336"]]