app/controllers/terms_controller.rb

  def index
    @terms = Term.all
---
SELECT "terms".* FROM "terms"

  def create
    @term = Term.new(term_params)
    if @term.save
---
INSERT INTO "terms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Spring 2025"], ["created_at", "2025-04-07 08:59:01.308117"], ["updated_at", "2025-04-07 08:59:01.308117"]]

  def update
    if @term.update(term_params)
---
UPDATE "terms" SET "name" = $1, "updated_at" = $2 WHERE "terms"."id" = $3  [["name", "Updated Term"], ["updated_at", "2025-04-07 08:59:01.491285"], ["id", 87]]

  def destroy
    @term.destroy
---
DELETE FROM "terms" WHERE "terms"."id" = $1  [["id", 89]]

  def set_term
    @term = Term.find(params[:id])
---
SELECT "terms".* FROM "terms" WHERE "terms"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]