app/controllers/users_controller.rb

  def index
    @users = User.all.order(id: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC